package org.javaacademy.module2.lesson6.homework3.ex2_searchTheDivination;

/** Задание №2: Поиск пары с помощью гадания
 Создать функциональный интерфейс гадание, который на вход принимает аргумент любого типа,
 на выход возвращает да/нет.
 Создать с помощью лямбд выражений:
 ромашку: принимает имя, возвращает да если в имени четное кол-во букв, нет если нечетное
 бабку гадалку: принимает Человека(возраст, рост),
 возвращает да - если (возраст + рост) больше 210, нет - если меньше или равно */

public class Runner {
    public static void main(String[] args) {

    }
}
