package org.javaacademy.module2.lesson6.homework3.ex3_burnBright;

/** Задание №3: Гори ясно!
 Создать функциональный интерфейс сжигание, ничего не возвращает, принимает аргумент
 любого типа.
 Создать класс уран (без атрибутов и методов)
 Создать класс дерево (без атрибутов и методов)
 Создать с помощью лямбд выражений:
 атомный реактор: принимает в себя уран, печатает на экран: зеленый свет вокруг!
 костер: принимает в себя дерево, печатает на экран: желто-красный свет вокруг! */

public class Runner {
    public static void main(String[] args) {

    }
}
