package org.javaacademy.module2.lesson6.homework3.ex4_universalRuler;

/** Задание №4: универсальная линейка
 Создать функциональный интерфейс линейка: принимает в себя любой тип, возвращает Integer
 Создать класс животное (длина тела, длина хвоста)
 Создать класс лодка(длина)
 Создать с помощью лямбд выражений:
 Измеритель лодок: на вход лодка, возвращает длину лодки
 Измеритель животных: на вход животное, возвращает сумму длин тела и хвоста */

public class Runner {
    public static void main(String[] args) {

    }
}
